define(function (require, exports, module) {
    'use strict';

    return [

        {
            title: '开发',
            id: 'home',
            job: [
                {
                    name: 'Java工程师',
                    content: [
                        '深圳 经验1-3年 本科及以上 全职',
                        '',
                        '任职要求：',
                        '1、熟悉Java语言，具备扎实的程序设计基本功和学习能力；',
                        '2、2年以上Java/J2EE开发经验，掌握Struts2、Spring、MyBatis/Hibernate等框架开发技术；',
                        '3、至少掌握两种软件服务器的使用，如：Apache、Nginx、Tomcat、weblogic等使用和配置；',
                        '4、熟悉Mysql/Oracle等数据库，熟悉SQL性能调优；',
                        '5、有互联网公司工作经验者优先；',
                        '6、责任心强，做事主动，善于合作，热爱互联网。'
                    ]
                },
                {
                    name: 'iOS工程师',
                    content: [
                        '深圳 经验1-3年 本科及以上 全职',
                        '',
                        '任职要求:',
                        '1. 工作年限：2-3年iOS开发经验',
                        '2. 英语要求：至少要过四级，要求能够阅读英文文档，查询英文资料。',
                        '3. 技能关键字：',
                        '熟悉AFNetworking/FMDB/CocoaTouch/Objective-C/MapKit/PushNotification/MVC框架',
                        '4. 学校和专业：优先考虑计算机/通信/数学/专业',
                        '5. 加分项：',
                        '5.1 有上架作品。请提供AppStore链接。',
                        '5.2 C/C++基础扎实，对熟悉数据库、网络编程',
                        '5.3 沟通表达能力优秀',
                        '5.4 业余开发独立项目/有技术blog/有开源代码'

                    ]
                },
                {
                    name: 'Android工程师:',
                    content: [
                        '深圳 经验1-3年 本科及以上 全职',
                        '',
                        '任职要求:',
                        '1. 工作年限：2-3年Android开发经验',
                        '2. 英语要求：熟练，至少要过四级，要求能够阅读英文文档，查询英文资料。',
                        '3. 学校和专业：优先考虑计算机/通信/数学/专业',
                        '4. 技能关键字：',
                        '4.1 熟练掌握Java编程',
                        '4.2 熟练掌握app 界面和逻辑的开发和调试',
                        '4.3 熟悉JSON/XML/Socket/HTTP',
                        '4.4 熟悉Android SDK',
                        '4.5 自定义控件',
                        '5. 有完整app作品的优先考虑。请提供产品链接。',
                        '6. 加分项：',
                        '6.1 C++基础扎实',
                        '6.2 熟悉Android分发渠道',
                        '6.3 沟通表达能力优秀',
                        '6.4 业余开发独立项目/有技术blog/有开源代码'

                    ]
                }, {
                    name: 'Web前端开发工程师',
                    content: [
                        '深圳 经验3-5年 本科及以上 全职',
                        '',
                        '任职要求:',
                        '1.有2年以上前端开发工作经验，特别优秀者除外；',
                        '2.精通HTML、CSS、Javascript、Ajax、jQuery等前台相关技术，熟悉angular框架，有大型门户平台网站、电子商务网站构建经验，熟练使用Java语言优先；',
                        '3.精通WEB标准页面开发，并实现兼容多终端和平台的WEB用户界面,很好的兼容IE、Firefox、Chrome等主流浏览器； ',
                        '4.熟悉网页性能优化和站点速度优化，能运用重构技术来提升用户体验； ',
                        '5.有钻研新技术的兴趣和能力，对业界最新的页面实现有浓厚的兴趣和深入的见解； ',
                        '6.善于交流和表达,有良好的团队合作精神； ',
                        '7.开发速度快、抗压能力强，可应对较大的工作压力。'
                    ]
                }, {
                    name: '测试工程师',
                    content: [
                        '深圳 经验不限 本科及以上 实习',
                        '',
                        '岗位职责：',
                        '1、负责公司移动端APP产品的测试；',
                        '2、编写测试计划，测试方案，测试用例；',
                        '3、实施软件测试，完成对产品的集成测试，主要负责产品的功能、性能及其他方面的测试；',
                        '4、对测试中发现的问题进行跟踪分析和报告，推动测试中发现问题及时合理地解决；',
                        '5、编写相关测试报告。',
                        '',
                        '任职要求:',
                        '1、至少1年以上Android/IOS系统APP及web相关测试经验；',
                        '2、熟悉软件测试流程，熟练掌握软件测试的方法和技巧，能够独立完成项目测试，优化测试工作、完善测试流程、把握项目进度和质量；',
                        '3、有自动化测试工作经验者优先考虑。'
                    ]
                }

            ]
        },
        {
            title: '产品',
            id: 'product',
            job: [
                {
                    name: '产品经理',
                    content: [
                        '深圳 经验1-3年 本科及以上 全职',
                        '',
                        '岗位职责:',
                        '1、根据公司和产品发展策略，负责产品策划管理工作，提升用户体验；',
                        '2、负责编写产品需求书产品原型，协助开发团队理解和掌握需求，对产品需求方向和易用性负责；',
                        '3、负责相关产品开发项目周期和进度把控，确保对产品开发至最终上线运营，对进度质量负责；',
                        '4、负责跨部门协调和沟通，推动UI、开发、测试、运营等人员紧密合作达成产品目标；',
                        '5、协调产品上线前的产品文档整理，商务推广，市场宣传等配合工作；',
                        '6、对用户需求、市场需求和业务需求进行调研分析，不断优化产品，提升产品质量，提高用户活跃度。',
                        '',
                        '职位要求:',
                        '1、本科及以上学历， 2年以上互联网产品经理经验；',
                        '2、熟悉产品设计理念及方法，对用户习性有独到认识，了解技术特性和系统构架；',
                        '3、熟悉互联网或软件产品整体实现过程，包括从需求分析到产品发布;',
                        '4、具备独立撰写产品文档的能力，熟练掌握产品需求分析、设计技巧,对交互设计过程有深入了解，有成功的产品策划案例；',
                        '5、具备较强的逻辑思维能力、学习创新能力、数据分析能力和语言表达能力；',
                        '6、较强的项目管理能力，善于跨部门组织、沟通和协调资源；',
                        '7、良好的沟通协调技巧和团队合作意识，能承受较大的工作压力。']
                },
                {
                    name: '交互设计师',
                    content: [
                        '深圳 经验3-5年 学历不限 全职',
                        '',
                        '任职要求：',
                        '1.不限学历，作品和实力是你最好的证明，当然平面设计、美术设计等相关专业者优先；',
                        '2.两年以上设计工作经验，最好是移动互联网UE/UI设计经验；',
                        '3.有扎实的美术功底、良好的创意思维和理解能力；',
                        '4.有很强的分析问题和解决问题的能力， 对视觉设计、色彩有敏锐的观察力及分析能力；',
                        '',
                        '岗位职责:',
                        '1、负责公司app的整体视觉感观，以及app运营活动的创意和展现.对页面进行优化，使用户操作更趋于人性化；',
                        '2、对产品需求的美观和易用性负责；',
                        '3、负责相关产品开发项目周期和进度把控，确保对产品开发至最终上线运营，对进度质量负责;协调产品上线前的产品文档整理，商务推广，市场宣传等配合工作；',
                        '4、跨部门协调和沟通，推动UI、开发、测试、运营等人员紧密合作达成产品目标；',
                        '5、对用户需求、市场需求和业务需求进行调研分析，不断优化产品，提升产品质量，提高用户活跃度。',
                        '',
                        '面试时请带上作品或者案例']
                }
            ]
        },
        {
            title: '运营',
            id: 'messages',
            job: [
                {
                    name: '内容运营',
                    content: [
                        '深圳 经验不限 大专及以上 实习',
                        '',
                        '岗位职责:',
                        '1、负责公司app的日常内容运营，活跃内容。 ',
                        '2、与用户做好日常互动，维护与更新信息。 ',
                        '3、对用户的网络行为进行分析与总结，挖掘和分析网友使用习惯、情感及体验感受，即时掌握热点。 ',
                        '4、跟踪运营效果，分析数据并反馈，总结经验； ',
                        '5、了解用户需求，妥善及时处理用户反馈，不断提升客户满意度；',
                        '6、完成领导安排的其他工作；',
                        '',
                        '职位要求:',
                        '1、有独立思考能力，网络人格外向，对网络文化、网络特性、网民心理具有敏锐的洞察力，思维活跃； ',
                        '2、有较强的文字功底，能独立创作文案； ',
                        '3、熟练使用图片处理、办公软件； ',
                        '4、工作积极主动，具有较强的沟通协调能力和执行能力，能够承受较大的工作压力。'
                    ]
                },
                {
                    name: '数据运营',
                    content: [
                        '深圳 经验不限 大专及以上 全职',
                        '',
                        '岗位职责:',
                        '1.使用excel等工具对数据信息进行分析、整理；',
                        '2.和市场部门对接，依据市场部门需要，提供相应统计数据；',
                        '3.使用地图软件获取所需数据。',
                        '',
                        '职位要求:',
                        '1.会计、数学、文秘等专业优先，接受实习生、应届毕业生；',
                        '2.细心高效，对数据敏感；',
                        '3.电脑操作能力良好，熟练使用Excel、地图软件；',
                        '4.团队合作精神，善于与人沟通。'
                    ]
                }
            ]
        },
        {
            title: '市场',
            id: 'market',
            job: [
                {
                    name: '营销策划',
                    content: [
                        '1.针对公司全年的运营目标，负责公司全年的营销计划制定和执行； ',
                        '2.根据公司全年营销目标，设定合理营销预算，降低单用户获取成本；',
                        '3.维护和拓展新的营销渠道，为目标用户的获取有效性负责；',
                        '',
                        '任职要求：',
                        '1.1年以上营销策划相关工作经验，优秀的创意能力；',
                        '2.有新媒体营销工作经验者优先；',
                        '3.良好的营销策划及推广传播规划能力，对社会热点有强烈敏锐度； ',
                        '4.能够挑战自我，具有创业激情。'
                    ]
                },
                {
                    name: '地推专员',
                    content: [
                        '深圳 经验不限 大专及以上 全职',
                        '',
                        '岗位职责：',
                        '1、负责执行所在城市APP推广计划，完成推广指标；',
                        '2、提升公司品牌知名度、用户下载量；维护推广资源，不断提升产品覆盖率；',
                        '3、直观了解线下用户需求，搜集APP产品在使用过程中产生的问题，及时反馈意见建议；',
                        '4、能独立完成地面推广工作，具有独当一面的能力。',
                        '',
                        '任职要求：',
                        '1、大专以上学历，有APP推广经验，如美团、饿了吗、58等O2O地推经验者优先；',
                        '2、为人诚信正直，充满激情，具备较强的事业心；',
                        '3、性格开朗，具备良好的理解能力、沟通能力和学习能力；具备优秀的团队协作精神和组织协调能力；',
                        '4、熟悉并热爱移动互联网行业，了解手机APP市场运作的基本流程。'

                    ]
                }
            ]

        }
    ];
});